tsung/GET_RedCup_tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="3index.eba-miy5wk4c.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="idle_timeout" value="60000"/>
    <option name="global_ack_timeout" value="60000"/>
  </options>

  <sessions>
    <session name="get" type="ts_http" weight="1">
      <request>
        <http method="GET" url="/"></http>
      </request>
      <thinktime value="5" random="true"></thinktime>
      <request>
        <http method="GET" url="/vlogs?page=2"></http>
      </request>
      <thinktime value="5" random="true"></thinktime>
      <request>
        <http method="GET" url="/vlogs/1/"></http>
      </request>
      <request>
        <http method="GET" url="/vlogs/2/"></http>
      </request>
    </session>
  </sessions>
</tsung>