tsung/POST_S3_RedCup_tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="7clientS3.eba-miy5wk4c.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="15" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="3" duration="15" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="5" duration="15" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="7" duration="15" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="9" duration="15" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="11" duration="15" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="12" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="13" duration="15" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="30000"></option>
  </options>
  <!--if this does not work, 删掉authtoken-->
  <sessions>    
    <session name="upload" type="ts_http" weight="1">
      <request>
        <http content_type="application/x-www-form-urlencoded"
              contents="vlog%5Btitle%5D=HelloWorld&amp;vlog%5Bcontent%5D=123456&amp;vlog%5Buser_name%5D=Anonymous&amp;vlog%5Buser_id%5D=5&amp;commit=Create%20Vlog&amp;vlog%5Bfile%5D=https://s3.maytheforcebewithyou.com"
              method="POST"
              url="/vlogs/"
              version="1.1">
        </http>
      </request>
      
    </session>
    
  </sessions>
</tsung>